iotest-nvme/fio-output/libaio-irq-randread-16k-1-1-log
test: (g=0): rw=randread, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=libaio, iodepth=1
fio-3.19
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=430363: Mon Oct 21 17:36:22 2024
  read: IOPS=278k, BW=4348MiB/s (4559MB/s)(63.7GiB/15001msec)
    slat (nsec): min=2010, max=125750, avg=2564.11, stdev=271.71
    clat (nsec): min=549, max=132730, avg=750.78, stdev=139.63
     lat (nsec): min=2810, max=136030, avg=3365.84, stdev=310.25
    clat percentiles (nsec):
     |  1.00th=[  732],  5.00th=[  732], 10.00th=[  732], 20.00th=[  740],
     | 30.00th=[  740], 40.00th=[  740], 50.00th=[  748], 60.00th=[  748],
     | 70.00th=[  748], 80.00th=[  764], 90.00th=[  764], 95.00th=[  772],
     | 99.00th=[  788], 99.50th=[  868], 99.90th=[ 1256], 99.95th=[ 3568],
     | 99.99th=[ 4704]
   bw (  MiB/s): min= 4338, max= 4373, per=100.00%, avg=4355.72, stdev=10.43, samples=29
   iops        : min=277672, max=279904, avg=278765.76, stdev=667.54, samples=29
  lat (nsec)   : 750=50.25%, 1000=49.55%
  lat (usec)   : 2=0.12%, 4=0.05%, 10=0.02%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%
  cpu          : usr=14.57%, sys=85.13%, ctx=40, majf=0, minf=22
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=4174572,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=4348MiB/s (4559MB/s), 4348MiB/s-4348MiB/s (4559MB/s-4559MB/s), io=63.7GiB (68.4GB), run=15001-15001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%