iotest-nvme/fio-output/libaio-irq-randread-4k-1-1-log
test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.19
Starting 1 process
test: Laying out IO file (1 file / 10240MiB)

test: (groupid=0, jobs=1): err= 0: pid=430236: Mon Oct 21 17:35:50 2024
  read: IOPS=353k, BW=1378MiB/s (1445MB/s)(20.2GiB/15001msec)
    slat (nsec): min=1511, max=103360, avg=1815.54, stdev=198.06
    clat (nsec): min=560, max=13330, avg=742.10, stdev=86.34
     lat (nsec): min=2130, max=112920, avg=2600.73, stdev=221.79
    clat percentiles (nsec):
     |  1.00th=[  724],  5.00th=[  732], 10.00th=[  732], 20.00th=[  732],
     | 30.00th=[  732], 40.00th=[  740], 50.00th=[  740], 60.00th=[  740],
     | 70.00th=[  740], 80.00th=[  740], 90.00th=[  748], 95.00th=[  748],
     | 99.00th=[  772], 99.50th=[  852], 99.90th=[ 1208], 99.95th=[ 3344],
     | 99.99th=[ 4384]
   bw (  MiB/s): min= 1372, max= 1389, per=100.00%, avg=1379.99, stdev= 4.58, samples=29
   iops        : min=351332, max=355654, avg=353277.31, stdev=1171.30, samples=29
  lat (nsec)   : 750=82.14%, 1000=17.69%
  lat (usec)   : 2=0.09%, 4=0.06%, 10=0.01%, 20=0.01%
  cpu          : usr=17.95%, sys=81.79%, ctx=29, majf=0, minf=21
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=5292065,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1378MiB/s (1445MB/s), 1378MiB/s-1378MiB/s (1445MB/s-1445MB/s), io=20.2GiB (21.7GB), run=15001-15001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%