iotest-nvme/fio-output/libaio-irq-randwrite-8k-1-1-log
test: (g=0): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
fio-3.19
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=431244: Mon Oct 21 17:40:09 2024
  write: IOPS=346k, BW=2704MiB/s (2835MB/s)(39.6GiB/15001msec); 0 zone resets
    slat (nsec): min=1670, max=131600, avg=1875.35, stdev=181.75
    clat (nsec): min=540, max=132030, avg=743.60, stdev=96.87
     lat (nsec): min=2330, max=139530, avg=2664.91, stdev=217.05
    clat percentiles (nsec):
     |  1.00th=[  732],  5.00th=[  732], 10.00th=[  732], 20.00th=[  740],
     | 30.00th=[  740], 40.00th=[  740], 50.00th=[  740], 60.00th=[  740],
     | 70.00th=[  740], 80.00th=[  748], 90.00th=[  748], 95.00th=[  748],
     | 99.00th=[  764], 99.50th=[  852], 99.90th=[ 1208], 99.95th=[ 2640],
     | 99.99th=[ 3728]
   bw (  MiB/s): min= 2691, max= 2721, per=100.00%, avg=2708.07, stdev= 8.35, samples=29
   iops        : min=344482, max=348360, avg=346632.48, stdev=1068.82, samples=29
  lat (nsec)   : 750=77.70%, 1000=22.12%
  lat (usec)   : 2=0.10%, 4=0.07%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%
  cpu          : usr=17.65%, sys=82.13%, ctx=24, majf=0, minf=17
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,5191368,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2704MiB/s (2835MB/s), 2704MiB/s-2704MiB/s (2835MB/s-2835MB/s), io=39.6GiB (42.5GB), run=15001-15001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%